In [2]:
from pandas import Series,DataFrame
import pandas as pd
import numpy as np

In [2]:
ser=pd.Series([3,4,1,3,3],index=list('abcde'))

In [3]:
print(ser)

a    3
b    4
c    1
d    3
e    3
dtype: int64

In [4]:
ser.rank()#默认method='average'

a    3.0
b    5.0
c    1.0
d    3.0
e    3.0
dtype: float64

In [5]:
ser.rank(method='min')

a    2.0
b    5.0
c    1.0
d    2.0
e    2.0
dtype: float64

In [6]:
ser.rank(method='max')

a    4.0
b    5.0
c    1.0
d    4.0
e    4.0
dtype: float64

In [7]:
ser.rank(method='first')

a    2.0
b    5.0
c    1.0
d    3.0
e    4.0
dtype: float64

In [8]:
df=pd.DataFrame(np.random.randint(0,5,[4,4]))

In [9]:
print(df)

   0  1  2  3
0  1  0  2  1
1  2  3  2  4
2  4  2  3  4
3  3  4  0  1

In [10]:
# 默认按照列排名

In [11]:
df.rank()

     0    1    2    3
0  1.0  1.0  2.5  1.5
1  2.0  3.0  2.5  3.5
2  4.0  2.0  4.0  3.5
3  3.0  4.0  1.0  1.5

In [12]:
# 按照行排名
df.rank(axis=1)

     0    1    2    3
0  2.5  1.0  4.0  2.5
1  1.5  3.0  1.5  4.0
2  3.5  1.0  2.0  3.5
3  3.0  4.0  1.0  2.0

# 时间序列

In [13]:
#创建时间序列
pd.date_range(start='20170101',end='20170110')

DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04',
               '2017-01-05', '2017-01-06', '2017-01-07', '2017-01-08',
               '2017-01-09', '2017-01-10'],
              dtype='datetime64[ns]', freq='D')

In [14]:
# 创建10个时间序列
pd.date_range(start='20170101',periods=10)

DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04',
               '2017-01-05', '2017-01-06', '2017-01-07', '2017-01-08',
               '2017-01-09', '2017-01-10'],
              dtype='datetime64[ns]', freq='D')

In [15]:
# 创建一个时间序列，步长为3天
pd.date_range(start='20170101',periods=10,freq='3D')

DatetimeIndex(['2017-01-01', '2017-01-04', '2017-01-07', '2017-01-10',
               '2017-01-13', '2017-01-16', '2017-01-19', '2017-01-22',
               '2017-01-25', '2017-01-28'],
              dtype='datetime64[ns]', freq='3D')

In [16]:
# 创建一个时间序列以分钟为步长
pd.date_range(start='2017-01-01 08:10:50',periods=10,freq='s')

DatetimeIndex(['2017-01-01 08:10:50', '2017-01-01 08:10:51',
               '2017-01-01 08:10:52', '2017-01-01 08:10:53',
               '2017-01-01 08:10:54', '2017-01-01 08:10:55',
               '2017-01-01 08:10:56', '2017-01-01 08:10:57',
               '2017-01-01 08:10:58', '2017-01-01 08:10:59'],
              dtype='datetime64[ns]', freq='S')

# 表合并

In [17]:
df1=pd.DataFrame({
    'data1':[1,2,3,4],
    'key1':['a','b','c','d']
})
df2=pd.DataFrame({
    'data2':[9,8,7,6],
    'key1':['a','b','e','f']
})

In [18]:
print(df1)

   data1 key1
0      1    a
1      2    b
2      3    c
3      4    d

In [19]:
print(df2)

   data2 key1
0      9    a
1      8    b
2      7    e
3      6    f

In [24]:
df3=pd.merge(df1,df2)
print(df3)

   data1 key1  data2
0      1    a      9
1      2    b      8

In [25]:
df4=pd.merge(df1,df2,how='outer',on='key1')
print(df4)

   data1 key1  data2
0    1.0    a    9.0
1    2.0    b    8.0
2    3.0    c    NaN
3    4.0    d    NaN
4    NaN    e    7.0
5    NaN    f    6.0

   data1 key1  data2
0    1.0    a    9.0
1    2.0    b    8.0
2    3.0    c    NaN
3    4.0    d    NaN
4    NaN    e    7.0
5    NaN    f    6.0

In [26]:
df6=pd.merge(df1,df2,left_index=True,right_index=True)
print(df6)

   data1 key1_x  data2 key1_y
0      1      a      9      a
1      2      b      8      b
2      3      c      7      e
3      4      d      6      f

In [27]:
# concat
df1=pd.DataFrame({
    'key':['a','a','b','b'],
    'data1':range(4)
})
df2=pd.DataFrame({
    'key':['b','b','c','c'],
    'data2':range(4)
})

In [28]:
print(df1)

  key  data1
0   a      0
1   a      1
2   b      2
3   b      3

In [29]:
print(df2)

  key  data2
0   b      0
1   b      1
2   c      2
3   c      3

In [30]:
print(pd.concat([df1,df2],axis=1))

  key  data1 key  data2
0   a      0   b      0
1   a      1   b      1
2   b      2   c      2
3   b      3   c      3

In [34]:
print(pd.concat([df1,df2],axis=0,join='outer'))

   data1  data2 key
0    0.0    NaN   a
1    1.0    NaN   a
2    2.0    NaN   b
3    3.0    NaN   b
0    NaN    0.0   b
1    NaN    1.0   b
2    NaN    2.0   c
3    NaN    3.0   c

E:\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  """Entry point for launching an IPython kernel.

# 分组

In [35]:
data=pd.DataFrame({
    'data1':np.random.randint(1,9,5),
    'data2':np.random.randint(1,9,5),
    'key1':list('aabba'),
    'key2':['one','one','two','one','two']
})

In [36]:
print(data)

   data1  data2 key1 key2
0      3      2    a  one
1      7      5    a  one
2      1      8    b  two
3      4      8    b  one
4      4      7    a  two

In [38]:
datas=data.groupby('key1')
print(datas)

<pandas.core.groupby.groupby.DataFrameGroupBy object at 0x0000000004EC0780>

In [39]:
for i in datas:
    print(i)

('a',    data1  data2 key1 key2
0      3      2    a  one
1      7      5    a  one
4      4      7    a  two)
('b',    data1  data2 key1 key2
2      1      8    b  two
3      4      8    b  one)

In [40]:
# 随机下标
key=[1,2,2,1,2]
data.groupby(key)['data1'].mean()

1    3.5
2    4.0
Name: data1, dtype: float64

In [41]:
# 通过某一列进行分组，分别获取一列或者两列数据
data.groupby('key1')['data1'].sum()

key1
a    14
b     5
Name: data1, dtype: int32

In [42]:
data.groupby('key1')['data1','data2'].sum()

      data1  data2
key1
a        14     14
b         5     16

In [44]:
datas=data.groupby(['key1','key2'])['data1','data2'].sum().unstack()
print(datas)

     data1     data2
key2   one two   one two
key1
a       10   4     7   7
b        4   1     8   8

In [45]:
datas.loc[:,'data1']['one']

key1
a    10
b     4
Name: one, dtype: int32

# 聚合

In [46]:
df1=pd.DataFrame(np.random.randint(1,9,(4,4)),columns=list('abcd'))
print(df1)

   a  b  c  d
0  4  1  3  2
1  8  2  1  4
2  5  1  5  8
3  3  5  4  7

In [48]:
df1.apply(lambda x:x*10)

    a   b   c   d
0  40  10  30  20
1  80  20  10  40
2  50  10  50  80
3  30  50  40  70

In [49]:
df1['a'].apply(lambda x : x*10)

0    40
1    80
2    50
3    30
Name: a, dtype: int64

In [50]:
df1.apply(lambda x : x*10,axis=1)

    a   b   c   d
0  40  10  30  20
1  80  20  10  40
2  50  10  50  80
3  30  50  40  70

In [51]:
df1.loc[0:2].apply(lambda x :x*10)

    a   b   c   d
0  40  10  30  20
1  80  20  10  40
2  50  10  50  80

In [56]:
def f1(x):
    return x+10
df1.apply(f1)

    a   b   c   d
0  14  11  13  12
1  18  12  11  14
2  15  11  15  18
3  13  15  14  17

In [54]:
df1[['b','c']].apply(f1)

    b   c
0  11  13
1  12  11
2  11  15
3  15  14

In [55]:
df1.apply(f1,axis=1)

    a   b   c   d
0  14  11  13  12
1  18  12  11  14
2  15  11  15  18
3  13  15  14  17

In [64]:
df1=pd.DataFrame(np.random.randint(1,9,(4,4)),columns=list('abcd'))
print(df1)

   a  b  c  d
0  5  1  3  5
1  7  1  4  1
2  2  6  1  3
3  1  2  4  5

In [60]:
# 求平均
def means(x):
    return x.mean()

re=df1.apply(means)
print(re)

a    6.00
b    5.00
c    4.50
d    3.25
dtype: float64

In [61]:
# 求和
def sums(x):
    return x.sum()
re=df1.apply(sums)
print(re)

a    24
b    20
c    18
d    13
dtype: int64

In [63]:
# 求最大值最小值的差
def diff(x):
    return x.max()-x.min()
df1.apply(diff)

a    3
b    2
c    1
d    1
dtype: int64

In [65]:
# 自定义操作-字符串拼接
data=np.random.randint(1,10,(4,4))
df1=pd.DataFrame(data,columns=['a','b','c','d'])
def f4(x,str_text):
    return str(x)+str_text

df1['a'].apply(f4,args=('hha',))# 通过args传入参数元素

0    1hha
1    3hha
2    6hha
3    1hha
Name: a, dtype: object

# 数据透视

In [4]:
data=pd.DataFrame({
    'data1':np.random.randint(1,9,5),
    'data2':np.random.randint(1,9,5),
    'key1':list('aabba'),
    'key2':['one','one','two','one','two']
})
data

   data1  data2 key1 key2
0      8      8    a  one
1      7      3    a  one
2      4      7    b  two
3      1      1    b  one
4      6      3    a  two

In [5]:
data.pivot_table(values=['data1','data2'],index=['key1'],columns=['key2'],aggfunc=np.mean)

     data1      data2
key2   one  two   one  two
key1
a      7.5  6.0   5.5  3.0
b      1.0  4.0   1.0  7.0